{"category":"patchouli:basics","icon":"minecraft:stone","name":"Caves","pages":[{"text":"There is a reason Minecraft was named Cavegame in the first place, $(l:basics/ores)ores$() are a key ingredient in progression. Though, caves have heavily changed from what you might know. For instance, caves below oceans are entirely flooded.","type":"text"},{"text":"While vanilla cave entries look familiar, caves soon get wider and bigger. This is what I like to call \"cliff caves\", because they look like cliffs. In most cases, you can jump them down safely, and only need a few blocks to come back.$(br2)Note that vanilla ravines still generate as usual. Also, crevices exist, which are sort of horizontal ravines.","type":"text"},{"text":"At the lower ends of the world, there are Huge Caves that reach from, let's say, y=5 to y=35 and look extremely cool. Often they have water or lava floors. You will also find Mega Caves that are even larger. Sometimes, they will even combine with a Huge Cave! (Any cave below y=7 is flooded with either water or lava. The bedrock is flat, so that shouldn't be a problem.)","type":"text"},{"text":"Things that you will find underground:$(br2)- Speleothems, aka Stalagmites and Stalactites. They are up to three blocks tall. If you break the supporting one, all others fall apart as well (which is super satisfying). You can also make them in the $(l:blocks/stonecutter)stonecutter$()$(br)- Growing cave roots that sometimes drop their edible sprouts$(br)- Glowing Mushrooms, which can be used as a substitution for $(l:botania/petals)petals$()","type":"text"},{"text":"- $(l:basics/ores)Various ores$()$(br)- $(l:blocks/stone_types)Various stone types$()$(br)- $(l:world/underground_biomes)Underground Biomes$()$(br)- Multiple structures, including $(l:structures/dungeon)Dungeons$(), $(l:structures/mineshaft)Mineshafts$() and $(l:structures/stronghold)Strongholds$()$(br)- $(l:blocks/dirt)Dirt$(), $(l:blocks/gravel)Gravel$() and $(l:blocks/clay)Clay$()$(br)- $(l:mobs/stoneling)Stonelings$()$(br)- $(l:mobs/bat)Bats$(br)- $(l:blocks/monster_box)Monster Boxes$()","type":"text"},{"text":"Monsters you will encounter:$(br2)- $(l:mobs/spawning)The seven monsters that can spawn anywhere$()$(br)- $(l:mobs/cave_spider)Cave Spiders$()$(br)- $(l:mobs/silverfish)Silverfish$() (when below $(l:biomes/mountain)mountains$())$(br)- $(l:mobs/toretoise)Toretoises$()","type":"text"}]}