{"category":"patchouli:basics","icon":"minecraft:crafting_table","name":"Welcome to Biomaticraft","pages":[{"text":"Welcome to Biomaticraft! This is a Minecraft modpack that is designed for both new and experienced players. It is progression-based, which means that you need to start using modded mechanics in order to unlock certain vanilla mechanics, as well as other modded mechanics.","type":"text"},{"text":"You might wonder what you are holding in your hands. Well, as you may have noted, the main page states that this book is a lexicon of nearly everything you can do in this modpack. If you wonder what some of the buttons in this book do, check out $(l:basics/using_this_book)Using this book$() for more information.","type":"text"},{"text":"You start this modpack as usual by getting $(l:basics/wood)wood$() and making a crafting table. You should make a pickaxe and mine some stone then. Note that the vanilla caves have been replaced by more exciting and nicer-to-explore caves from the Better Caves mod. See $(l:basics/caves)Caves$() for more information.","type":"text"},{"text":"Before you do, however, note some things. When you hover over an item, press the $(k:jei.showRecipe) key to see how you craft that item. You can press $(k:jei.showUses) to see what you can do with it as well. You will also have noted that window showing all items to the right of your inventory. This is called the JEI Overlay. See $(l:basics/using_jei)Using JEI$() for more information.","type":"text"},{"recipe":"crafttweaker:guide_book","text":"If you lose this book, you can easily craft it again. Also, note that you can hold CTRL down on an item in your inventory to see the item's information in this book. It is therefore recommended that you bring this book with you, wherever you go.","type":"crafting"},{"text":"This book is advancement-locked. This means that you will get access to more pages once you proceed in the advancements tab. Press $(k:advancements) to open the advancements tab. There are neither hidden advancements nor hidden pages.","type":"text"},{"text":"Finally, I want to thank you for playing this modpack.$(br2)Sincerely,$(br)IchHabeHunger54, the modpack (and this book's) author","type":"text"}],"priority":true}