{"category":"patchouli:basics","icon":"jei:textures/gui/icons/config_button.png","name":"Using JEI","pages":[{"text":"As you probably already know, you can press $(k:jei.showRecipe) and $(k:jei.showUses) on an item to show its recipes and its uses, respectively. However, there are some other things you should note about JEI. JEI itself stands for Just Enough Items, by the way.","type":"text"},{"text":"First, scrolling can also be done with the keys $(k:jei.previousPage) and $(k:jei.nextPage). JEI also keeps a history of your previously looked up recipes, and you can press $(k:jei.recipeBack) to go back to the ones previously viewed.","type":"text"},{"text":"There are seven pages of recipe categories. Each category represents a different block (sometimes multiple blocks) the recipe can be done on. When you click on the category title (for example Crafting in the Crafting Table category), you can see all recipes for that category.","type":"text"},{"text":"It should be noted that the Fissile Reactor and the Supercritical Phase Shifter are multiblocks that cannot be displayed. Also, JEI doesn't always work properly. For instance, a lot of disabled arrow types show up at the end of the Crafting Table category.","type":"text"},{"text":"The next is something you might not notice, but is actually very useful. Pressing $(k:jei.bookmark) on an item will bookmark it, showing up in a separate list at the left of your inventory. (Note that this will not work in the inventory itself, you need to do it in the item list.) Pressing $(k:jei.bookmark) again removes it from the bookmark list.$(br2)Both bookmark and item list can be toggled using $(k:jei.toggleBookmarkOverlay) and $(k:jei.toggleOverlay), respectively.","type":"text"},{"text":"The last thing to note is the search bar. It can be selected using $(k:jei.focusSearch) or by clicking inside it. Besides being just a regular search bar, it comes with some extra steps:$(br2)- Typing @ before something will search in the mod name.$(br)Example: @minecraft$(br)- Typing # before something will search in the tooltips.$(br)Example: #shift$(br)- Typing - before something will exclude it.$(br)Example: -stone","type":"text"},{"text":"- Multiple special queries can be combined. Example:$(br)@minecraft #shift -stone$(br)- Something like -@minecraft does not work, however. -#, @# and -@# don't work either.$(br2)Using JEI efficiently is something every good modded minecraft player should be capable of.","type":"text"}]}